hpmicro/rtt-bsp-hpm6750evk2/common/libraries/hpm_sdk/soc/ip/hpm_adc12_regs.h
/*
 * AHB_ERR (W1C)
 *
 * set if got hresp=1, generally caused by wrong trg_dma_addr or seq_dma_addr
 */
#define ADC12_INT_EN_AHB_ERR_MASK (0x200000UL)
#define ADC12_INT_EN_AHB_ERR_SHIFT (21U)
#define ADC12_INT_EN_AHB_ERR_SET(x) (((uint32_t)(x) << ADC12_INT_EN_AHB_ERR_SHIFT) & ADC12_INT_EN_AHB_ERR_MASK)
#define ADC12_INT_EN_AHB_ERR_GET(x) (((uint32_t)(x) & ADC12_INT_EN_AHB_ERR_MASK) >> ADC12_INT_EN_AHB_ERR_SHIFT)

/*
 * WDOG (W1C)
 *
 * set if one chanel watch dog event triggered
 */
#define ADC12_INT_EN_WDOG_MASK (0x7FFFFUL)
#define ADC12_INT_EN_WDOG_SHIFT (0U)
#define ADC12_INT_EN_WDOG_SET(x) (((uint32_t)(x) << ADC12_INT_EN_WDOG_SHIFT) & ADC12_INT_EN_WDOG_MASK)
#define ADC12_INT_EN_WDOG_GET(x) (((uint32_t)(x) & ADC12_INT_EN_WDOG_MASK) >> ADC12_INT_EN_WDOG_SHIFT)

/* Bitfield definition for register: ANA_CTRL0 */
/*
 * CAL_VAL_DIFF (RW)
 *
 * calibration value for differential mode
 */
#define ADC12_ANA_CTRL0_CAL_VAL_DIFF_MASK (0x7F000000UL)
#define ADC12_ANA_CTRL0_CAL_VAL_DIFF_SHIFT (24U)
#define ADC12_ANA_CTRL0_CAL_VAL_DIFF_SET(x) (((uint32_t)(x) << ADC12_ANA_CTRL0_CAL_VAL_DIFF_SHIFT) & ADC12_ANA_CTRL0_CAL_VAL_DIFF_MASK)
#define ADC12_ANA_CTRL0_CAL_VAL_DIFF_GET(x) (((uint32_t)(x) & ADC12_ANA_CTRL0_CAL_VAL_DIFF_MASK) >> ADC12_ANA_CTRL0_CAL_VAL_DIFF_SHIFT)

/*
 * CAL_VAL_SE (RW)
 *
 * calibration value for single-end mode
 */
#define ADC12_ANA_CTRL0_CAL_VAL_SE_MASK (0x7F0000UL)
#define ADC12_ANA_CTRL0_CAL_VAL_SE_SHIFT (16U)
#define ADC12_ANA_CTRL0_CAL_VAL_SE_SET(x) (((uint32_t)(x) << ADC12_ANA_CTRL0_CAL_VAL_SE_SHIFT) & ADC12_ANA_CTRL0_CAL_VAL_SE_MASK)
#define ADC12_ANA_CTRL0_CAL_VAL_SE_GET(x) (((uint32_t)(x) & ADC12_ANA_CTRL0_CAL_VAL_SE_MASK) >> ADC12_ANA_CTRL0_CAL_VAL_SE_SHIFT)

/*
 * REARM_EN (RW)
 *
 * set will insert one adc cycle rearm before sample, user need to increase one to sample_clock_number
 */
#define ADC12_ANA_CTRL0_REARM_EN_MASK (0x4000U)
#define ADC12_ANA_CTRL0_REARM_EN_SHIFT (14U)
#define ADC12_ANA_CTRL0_REARM_EN_SET(x) (((uint32_t)(x) << ADC12_ANA_CTRL0_REARM_EN_SHIFT) & ADC12_ANA_CTRL0_REARM_EN_MASK)
#define ADC12_ANA_CTRL0_REARM_EN_GET(x) (((uint32_t)(x) & ADC12_ANA_CTRL0_REARM_EN_MASK) >> ADC12_ANA_CTRL0_REARM_EN_SHIFT)

/*
 * SELRANGE_LDO (RW)
 *
 * Defines the range for the LDO reference (vdd_soc)
 * selrange_ldo = 0: LDO reference dvdd or vref_ldo in range [0.81;0.99]
 * selrange_ldo = 1: LDO reference dvdd or vref_ldo in range [0.99;1.21]
 */
#define ADC12_ANA_CTRL0_SELRANGE_LDO_MASK (0x800U)
#define ADC12_ANA_CTRL0_SELRANGE_LDO_SHIFT (11U)
#define ADC12_ANA_CTRL0_SELRANGE_LDO_SET(x) (((uint32_t)(x) << ADC12_ANA_CTRL0_SELRANGE_LDO_SHIFT) & ADC12_ANA_CTRL0_SELRANGE_LDO_MASK)
#define ADC12_ANA_CTRL0_SELRANGE_LDO_GET(x) (((uint32_t)(x) & ADC12_ANA_CTRL0_SELRANGE_LDO_MASK) >> ADC12_ANA_CTRL0_SELRANGE_LDO_SHIFT)

/*
 * ENLDO (RW)
 *
 * set to enable adc LDO, need at least 20us for LDO to be stable.
 */
#define ADC12_ANA_CTRL0_ENLDO_MASK (0x40U)
#define ADC12_ANA_CTRL0_ENLDO_SHIFT (6U)
#define ADC12_ANA_CTRL0_ENLDO_SET(x) (((uint32_t)(x) << ADC12_ANA_CTRL0_ENLDO_SHIFT) & ADC12_ANA_CTRL0_ENLDO_MASK)
#define ADC12_ANA_CTRL0_ENLDO_GET(x) (((uint32_t)(x) & ADC12_ANA_CTRL0_ENLDO_MASK) >> ADC12_ANA_CTRL0_ENLDO_SHIFT)

/*
 * ENADC (RW)
 *
 * set to enable adc analog function. user need set it after LDO stable, or wait at least 20us after setting enldo, then set this bit.
 */
#define ADC12_ANA_CTRL0_ENADC_MASK (0x20U)
#define ADC12_ANA_CTRL0_ENADC_SHIFT (5U)
#define ADC12_ANA_CTRL0_ENADC_SET(x) (((uint32_t)(x) << ADC12_ANA_CTRL0_ENADC_SHIFT) & ADC12_ANA_CTRL0_ENADC_MASK)
#define ADC12_ANA_CTRL0_ENADC_GET(x) (((uint32_t)(x) & ADC12_ANA_CTRL0_ENADC_MASK) >> ADC12_ANA_CTRL0_ENADC_SHIFT)

/*
 * RESETADC (RW)
 *
 * set to 1 to reset adc analog; default high.
 */
#define ADC12_ANA_CTRL0_RESETADC_MASK (0x10U)
#define ADC12_ANA_CTRL0_RESETADC_SHIFT (4U)
#define ADC12_ANA_CTRL0_RESETADC_SET(x) (((uint32_t)(x) << ADC12_ANA_CTRL0_RESETADC_SHIFT) & ADC12_ANA_CTRL0_RESETADC_MASK)
#define ADC12_ANA_CTRL0_RESETADC_GET(x) (((uint32_t)(x) & ADC12_ANA_CTRL0_RESETADC_MASK) >> ADC12_ANA_CTRL0_RESETADC_SHIFT)

/*
 * RESETCAL (RW)
 *
 * set to 1 to reset calibration logic; default high.
 */
#define ADC12_ANA_CTRL0_RESETCAL_MASK (0x8U)
#define ADC12_ANA_CTRL0_RESETCAL_SHIFT (3U)
#define ADC12_ANA_CTRL0_RESETCAL_SET(x) (((uint32_t)(x) << ADC12_ANA_CTRL0_RESETCAL_SHIFT) & ADC12_ANA_CTRL0_RESETCAL_MASK)
#define ADC12_ANA_CTRL0_RESETCAL_GET(x) (((uint32_t)(x) & ADC12_ANA_CTRL0_RESETCAL_MASK) >> ADC12_ANA_CTRL0_RESETCAL_SHIFT)

/*
 * STARTCAL (RW)
 *
 * set to start the offset calibration cycle (Active H). user need to clear it after setting it.
 */
#define ADC12_ANA_CTRL0_STARTCAL_MASK (0x4U)
#define ADC12_ANA_CTRL0_STARTCAL_SHIFT (2U)
#define ADC12_ANA_CTRL0_STARTCAL_SET(x) (((uint32_t)(x) << ADC12_ANA_CTRL0_STARTCAL_SHIFT) & ADC12_ANA_CTRL0_STARTCAL_MASK)
#define ADC12_ANA_CTRL0_STARTCAL_GET(x) (((uint32_t)(x) & ADC12_ANA_CTRL0_STARTCAL_MASK) >> ADC12_ANA_CTRL0_STARTCAL_SHIFT)

/*
 * LOADCAL (RW)
 *
 * Signal that loads the offset calibration word into the internal registers (Active H)
 */
#define ADC12_ANA_CTRL0_LOADCAL_MASK (0x2U)
#define ADC12_ANA_CTRL0_LOADCAL_SHIFT (1U)
#define ADC12_ANA_CTRL0_LOADCAL_SET(x) (((uint32_t)(x) << ADC12_ANA_CTRL0_LOADCAL_SHIFT) & ADC12_ANA_CTRL0_LOADCAL_MASK)
#define ADC12_ANA_CTRL0_LOADCAL_GET(x) (((uint32_t)(x) & ADC12_ANA_CTRL0_LOADCAL_MASK) >> ADC12_ANA_CTRL0_LOADCAL_SHIFT)

/* Bitfield definition for register: ANA_CTRL1 */
/*
 * SELRES (RW)
 *
 * 11-12bit
 * 10-10bit
 * 01-8bit
 * 00-6bit
 */
#define ADC12_ANA_CTRL1_SELRES_MASK (0xC0U)
#define ADC12_ANA_CTRL1_SELRES_SHIFT (6U)
#define ADC12_ANA_CTRL1_SELRES_SET(x) (((uint32_t)(x) << ADC12_ANA_CTRL1_SELRES_SHIFT) & ADC12_ANA_CTRL1_SELRES_MASK)
#define ADC12_ANA_CTRL1_SELRES_GET(x) (((uint32_t)(x) & ADC12_ANA_CTRL1_SELRES_MASK) >> ADC12_ANA_CTRL1_SELRES_SHIFT)

/* Bitfield definition for register: ANA_STATUS */
/*
 * CALON (RW)
 *
 * Indicates if the ADC is in calibration mode (Active H).
 */
#define ADC12_ANA_STATUS_CALON_MASK (0x80U)
#define ADC12_ANA_STATUS_CALON_SHIFT (7U)
#define ADC12_ANA_STATUS_CALON_SET(x) (((uint32_t)(x) << ADC12_ANA_STATUS_CALON_SHIFT) & ADC12_ANA_STATUS_CALON_MASK)
#define ADC12_ANA_STATUS_CALON_GET(x) (((uint32_t)(x) & ADC12_ANA_STATUS_CALON_MASK) >> ADC12_ANA_STATUS_CALON_SHIFT)

